#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/ebc5e65c-1230-4062-840f-61a750fe2263/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "new-luis-n2di"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ folder_id           = "646893177009" -> "250869018475"
        id                  = "projects/new-luis-n2di"
        name                = "new-luis"
        # (5 unchanged attributes hidden)
    }

  # module.project-factory["new-luis"].module.project-factory.module.project_services.google_project_service.project_services["storage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "new-luis-n2di"
      + service                    = "storage.googleapis.com"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "new-luis-n2di"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_project.main will be updated in-place%0A  ~ resource "google_project" "main" {%0A      ~ folder_id           = "646893177009" -> "250869018475"%0A        id                  = "projects/new-luis-n2di"%0A        name                = "new-luis"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.module.project_services.google_project_service.project_services["storage.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = true%0A      + id                         = (known after apply)%0A      + project                    = "new-luis-n2di"%0A      + service                    = "storage.googleapis.com"%0A    }%0A%0APlan: 1 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @luismendezescobar, Action: `pull_request`, Working Directory: `/home/runner/work/project-factory/project-factory`, Workflow: `validate code`*